#include <stdio.h>

 int main()
 {
    printf("Введите границы диапазона A и B одной строкой через пробел:\n");
    int A,B;
    scanf("%d%d",&A,&B);
    printf("Введите 10 чисел через пробел:\n");
    int a[10], S=0,k=0,k1=0,s=0; 
    for(int i=0;i<10;i++)
    {
        scanf("%d",&a[i]); 
        if (a[i]>0) k+=1;
        if (a[i]%2==0) S+=a[i];
        if (i>=A-1 && i<=B-1)
        {
            k1+=1;
            s+=a[i];
        }
    }
    printf("Количетсво положительных:%d\nСумма четных:%d\nКоличество из диапазона:%d\nСумма диапазона:%d ",k,S,k1,s);
 }